---
kind: method
id: M:Autodesk.Revit.DB.GeomCombinationSetIterator.#ctor
source: html/5d176497-9a18-1aa2-3faf-1f636082083b.htm
---
# Autodesk.Revit.DB.GeomCombinationSetIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public GeomCombinationSetIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.